<script setup lang="ts">
import { AppIcon }                     from "@/components/AppIcon";
import { DropdownMenu }                from "@/components/DropdownMenu";
import { FormSearch }                  from "@/components/FormSearch";
import InputSearchbar                  from "@/components/InputSearchBar/InputSearchbar.vue";
import { useAppStore, useSearchStore } from "@/store";

const searchStore = useSearchStore();
const appStore = useAppStore();

const { toggleSearchResultsContainer } = searchStore;

function openDrawerForms() {
	appStore.toggleDrawerForms(true);
}

function openModalHowToUseAI() {
	appStore.toggleModalWindowHowToUseAI(true);
}
</script>

<template>
	<header class="bg-white z-10 border-b-[0.2rem] border-brown-inputBorder">
		<div class="w-full px-20 pt-3 pb-3">
			<div class="flex items-center">
				<!-- BRAND LOGO -->
				<div class="text-primary mr-10">
					<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 423 115" class="w-auto h-16 block">
						<path
							fill="currentColor"
							d="M61.507 52.78v59.566L45.54 115l-2.486-2.174V87.564c-6.155 1.082-12.422 1.93-16.681 1.93C12.768 89.493 0 83.94 0 67.394 0 56.168 6.858 47.83 16.09 44.451l-.122-.97C8.63 40.102 2.72 34.428 2.72 24.037c0-11.962 11.117-22.833 29.571-22.833 8.876 0 16.203.97 24.008 3.256l1.305 2.654-5.32 13.892c-6.389-2.052-12.768-3.869-19.28-3.869-6.51 0-10.76 3.746-10.76 9.9 0 5.798 5.798 10.994 17.027 10.994h36.664l1.916 2.296-2.007 12.442H61.507v.01Zm-23.182 0c-13.125 0-18.689 6.399-18.689 12.799 0 4.593 4.025 9.053 11.474 9.053 4.973 0 8.52-.847 11.943-1.806V52.779h-4.728ZM108.076.49c16.08 0 26.515 7.461 26.515 25.231 0 15.75-10.995 25.231-26.586 25.231-6.124 0-10.781-.204-15.59-.49V.98c5.777-.276 9.119-.49 15.651-.49h.01Zm-7.928 44.114c2.364.275 4.596.347 8 .347 11.209 0 18.158-7.809 18.158-19.24 0-11.432-6.888-19.24-18.087-19.24-3.903 0-5.778.143-8.071.419v37.713Zm50.93 5.858h-7.724V.98h7.724v49.482Zm33.464.98c-14.124 0-24.63-8.084-24.63-25.302 0-15.688 10.71-26.14 24.844-26.14 5.849 0 9.599.49 14.398 2.235l.418 1.041-2.65 5.573c-4.656-1.602-7.927-2.164-11.688-2.164-9.884 0-16.976 7.88-16.976 19.312 0 11.431 7.092 19.025 16.844 19.025 3.76 0 6.888-.347 9.11-1.327V32.682h-11.688l-.907-.837 1.111-5.021h18.862v21.189c-4.454 2.296-9.324 3.42-17.048 3.42v.01Zm58.665-6.42-.978 5.44h-30.061V.98h29.572l.631.837-.978 5.44h-21.501v15.055h16.284l.621.837-.978 5.44h-15.937v15.617h22.683l.632.837.01-.02Zm3.26-19.301C246.467 10.738 256.83 0 271.514 0 286.198 0 296.5 7.951 296.5 25.721c0 14.984-10.231 25.721-24.986 25.721s-25.047-8.012-25.047-25.72Zm25.118 19.658c9.956 0 16.702-8.359 16.702-19.658 0-11.299-6.746-19.658-16.773-19.658s-16.702 8.36-16.702 19.658c0 11.3 6.818 19.658 16.773 19.658Zm55.466-38.683c-9.885 0-16.834 7.88-16.834 19.31 0 11.432 6.888 18.75 16.773 18.75 4.381 0 8.977-1.112 13.359-3.133l2.649 5.226-.418.98c-4.728 2.235-9.741 3.623-16.283 3.623-14.052 0-24.426-8.083-24.426-25.302 0-15.617 10.363-26.14 24.63-26.14 5.91 0 9.67.562 14.266 2.235l.417 1.042-2.649 5.572c-4.453-1.602-7.795-2.163-11.484-2.163Zm24.424 43.766h-7.102l-.561-.98 17.884-48.227 7.306-.632 18.444 48.86-.631.98h-7.724l-4.668-13.382h-18.372l-4.596 13.381h.02Zm21.012-19.24-7.031-20.209-.55-.071-6.889 20.28h14.47Zm34.514 19.24h-7.724V7.247h-15.173l-.764-.837 1.111-5.44h37.856l.693.837-1.04 5.44h-14.959v43.215Zm-318.388 54.28h21.429l1.111 1.256-1.182 7.175H77.75V63.69h10.852v41.052h.01Zm39.659 8.431H117.42V63.69h10.852v49.483Zm36.746-26.068.072.561c7.449 1.398 11.198 6.624 11.198 12.197 0 8.084-7.591 13.871-19.483 13.871-7.164 0-12.034-.275-16.701-.561V63.69c3.057-.214 8.488-.56 15.865-.56 11.199 0 18.72 2.857 18.72 12.34 0 5.082-3.271 9.685-9.671 11.635Zm-14.052-2.644c7.999 0 12.177-2.858 12.177-7.318 0-4.46-3.485-6.206-8.488-6.134-1.253 0-2.507 0-3.689.143v13.31Zm0 21.118c.978.072 2.639.204 4.035.204 4.943 0 9.742-2.092 9.742-6.828 0-4.46-3.76-7.247-13.777-7.247v13.871Zm47.72 1.603c0 3.48-2.71 6.971-6.746 6.971-3.76 0-6.256-2.787-6.256-6.063 0-3.97 2.924-6.696 6.603-6.696 4.524 0 6.399 2.236 6.399 5.788Z" />
					</svg>
				</div>

				<div class="flex flex-col flex-shrink w-full">
					<div class="flex">
						<div class="basis-3/4">
							<FormSearch class="w-full" />
						</div>

						<div class="ml-auto">
							<DropdownMenu :items="[{ label: 'item-1' }, { label: 'item-2' }, { label: 'item-2'}]">
								<template #button="{ clickHandler }">
									<button class="btn btn--tertiary" @click="clickHandler()">
										<AppIcon name="bars-3" size="regular" />
									</button>
								</template>
							</DropdownMenu>
						</div>
					</div>

					<div>
						<div
							class="text-[11px] flex w-fit items-center p-0.5 pb-0 italic text-brown-dark hover:text-brown-hover cursor-pointer"
							@click="openDrawerForms()"
						>
							<div>Jednotlivé parametry vyhledávání můžeš zadat do formuláře</div>
							<div>
								<AppIcon name="cursor-arrow-rays" :size="['18px']" />
							</div>
						</div>
					</div>
				</div>
			</div>
		</div>
	</header>
</template>
